In [1]:
# Run this cell once to set up the database connection, engine, and custom magic.
# The '-i' flag runs the script in this notebook's interactive namespace,
# making variables like 'db_engine' available here.
# Assumes this notebook is in 'notebooks/' and the script is in 'src/'
%run -i ../src/notebook_setup.py

--- Importing FULL mysql_lab_magic.py ---
--- Finished defining FULL mysql_lab_magic.py ---
Running notebook setup...
Loaded environment variables from .env file.
Database URL configured for: 127.0.0.1:3307/query_lab_db
Successfully created SQLAlchemy engine ('db_engine') and connected to database.
Registering custom MySQLLabMagic class directly...
Custom '%%mysql_lab' magic registered successfully.
Notebook setup complete.

In [2]:
%%mysql_lab

SELECT *
FROM departments
LIMIT 5;

  dept_no         dept_name
0    d009  Customer Service
1    d005       Development
2    d002           Finance
3    d003   Human Resources
4    d001         Marketing

In [3]:
%%mysql_lab
SELECT COUNT(*) AS total_departments FROM departments;

   total_departments
0                  9